
## Plan Result (dev/account)

[CI link](https://github.com/tooruuetani/gh-actions-test/actions/runs/8683648671)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_lambda_function.main
* Replace
  * null_resource.generate_dummy_image


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "gha-test-lambda-dev"
      + id                             = (known after apply)
      + image_uri                      = "082954585471.dkr.ecr.ap-northeast-1.amazonaws.com/gha-test-account-lambda:dev"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::082954585471:role/gha-test-lambda-role-dev"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + image_config {
          + command = [
              + "handler.lambda_handler",
            ]
        }
    }

  # null_resource.generate_dummy_image is tainted, so must be replaced
-/+ resource "null_resource" "generate_dummy_image" {
      ~ id       = "40639623560802867" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"account_terraform_plan_dev","PRNumber":18,"Program":"tfcmt","SHA1":"496708bb305ceb5d561b4a642f31e2adb68ee6b6","Target":"dev/account","Vars":{},"WorkflowName":"common-check"} -->